{"podcast_details": {"podcast_title": "Afternoon - Gigi Edition", "episode_title": "Afternoon - Trailer", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/7fc9b60370b8e1bd9bde8379885fe9b5.jpg", "episode_transcript": " Dove la conzzigi durissimo, è durissimo io perché so cosa penso. Dai dai dai. Ciao a tutti, io sono Nicolo Mellin, giocatore di pala canesto per l'Olimpia Milano e per la Nazionale di Basket. Qui con me, co-conduttore di questo podcast c'è Gigi Atome, ex giocatore dell'Olimpia Milano ma attuale giocatore dell'Azionale di Basket. Esfruttiamo noi questa situazione un po' particolare, questo suo doppio ruolo per rendervi partecipi del nostro raduno, del nostro percorso di avvicinamento ai Mondiali 2023 nelle Filippine. Idea sua eh. Mi assumo io la colpa di questo podcast. Vogliamo rendervi partecipi appunto di questo nostro cammino, sarà un podcast molto veloce, vi presenteremo tutti i nostri compagni di squadra, l'allenatore, le puntate saranno appunto molto snelle. La nostra priorità ovviamente è quella di preparare un Mondiale, quindi gli allenamenti, le partite hanno ovviamente appunto la priorità su tutto, quindi se dovessimo avere ritardi, slittamenti o così qualche imprevisto è perché ovviamente il nostro focus è tutto sulla preparazione a questo Mondiale. Siate clementi insomma. Speriamo che sia un bel cammino insieme, speriamo di divertirvi, speriamo di rendervi ancora più partecipi di quello che facciamo e seguitici."}, "podcast_summary": "Summary: The podcast transcript introduces Nicolo Mellin, a basketball player for Olimpia Milano and the National Basketball Team, and his co-host Gigi Atome. They discuss their training and preparation for the 2023 World Cup in the Philippines and aim to involve the listeners in their journey. The podcast will be focused on introducing teammates and the coach, and may experience delays or disruptions due to their prioritization of training and games. They hope to entertain and engage the listeners throughout their journey.", "podcast_guest": "Gigi Atome", "podcast_highlights": "Summary:\nThe podcast is hosted by Nicolo Mellin, a basketball player for Olimpia Milano and the National Basketball Team, with Gigi Atome, a former Olimpia Milano player and current player for the National Basketball Team. They use this podcast to involve listeners in their journey towards the 2023 World Cup in the Philippines. The focus of the podcast will primarily be on their training and preparation for the competition, and they ask for understanding if there are any delays or unexpected events due to this focus. They hope to have a successful and enjoyable journey together with the listeners.\n\nKey insights:\n- The podcast is created by Nicolo Mellin and Gigi Atome to involve listeners in their journey towards the 2023 World Cup in the Philippines.\n- The focus of the podcast will be on their training and preparation for the competition.\n- They prioritize their training and matches for the World Cup, and any delays or unexpected events may occur due to this focus.\n\nCritical questions:\n- How will Nicolo Mellin and Gigi Atome keep listeners engaged and involved in their journey to the World Cup?\n- What specific aspects of their training and preparation will they discuss in the podcast?\n- How do Nicolo Mellin and Gigi Atome plan to balance their dual roles as players for both Olimpia Milano and the National Basketball Team during the World Cup preparation?"}