{"podcast_details": {"podcast_title": "The Rest Is Football", "episode_title": "From Gazza to Haaland", "episode_image": "https://megaphone.imgix.net/podcasts/30860506-223b-11ee-9234-a787dafa51ef/image/TRIF_ARTWORK_FINAL_V2.jpeg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Welcome along to the Rest is Football with me, Gary Lineker, Alan Shearer and Micah Richards. This time we're going to be answering the latest batch of your questions. You can send them to at Rest is Football on all the main social channels or email us at therestisfootballatgmail.com. We're going to jump straight in today with this one from Blinds85. Would Micah have preferred to play against a prime Shearer or a prime Lineker? I'm not sure what prime means. That's a very good question actually. I would have liked to play against Shearer because he was a lot more physical. I think your movement and I've watched a lot of your clips. Your movement was very, very good. So just when I think I've got you. You'd never have me Micah. You'd never have me. But I'd like the physical battle with Alan. So I'm going to go Alan on that one. Okay, that's good. I knew you'd want to play against him. It's much easier to play against him. Here's one for you Alan actually from Ian Finch. I recognise that name. I wonder if that's the... Oh Finchie!...Match of the Day producer quite possibly. He's a big fan of the podcast obviously. Great stuff Finchie. If All Night Long by Lionel Richie wasn't available on the karaoke machine, what tune would you choose as a backup Alan? Your sex is on fire! Oh wow, that's sound. We've had some fun don't we at World Cups and the European Championship with the odd sing song after an England win or something. Remember the cheese straws Alan? The bread stick wasn't it? Yeah, the bread stick man. In Moscow. It was, it was. You're supposed to sing with it not eat it. You remember that. That was the other one in Qatar as well. We had a fun night towards the end. We have to make our own entertainment at times. I mean they're quite long months those tournaments together. There's lots of football and lots of work but by the time you get to the quarterfinals there's big gaps in between. I know it's for them to ask but what has been your best tournament in terms of broadcasting? Which have you enjoyed the most since you've been doing it? I know it's supposed to be quick fire but I mean. I think maybe actually Moscow. I know that's a bit strange and what's happened in Russia subsequently and had already happened in terms of before that on the war front and Ukraine and stuff but it was a fun World Cup. The football was great. The stadiums were great as well. The only thing is with that one we had to do them in the studio in Red Square. One thing that Qatar had the edge on which was purely selfish reasons is that we could because it's such a tiny country we could actually go to every game couldn't we? And actually being in the stadium is so much better than broadcasting a game where you're actually watching it on the telly. You know what I mean Alan? That was a real plus for that tournament wasn't it? By the sheer geographical nature of the country. In the end when England were playing they played in that stadium we were moaning that it was too far away when it was what 55 minutes away. In what in three years time the travelling we're going to have to do in between games is going to be mad isn't it when it's in America, Canada and Mexico is it? I think it is. Exactly I think my favourite the favourite broadcast though in any World Cup that I've done would be the final in Qatar. I mean how extraordinary that extra time was breathtaking wasn't it? Yeah absolutely amazing. Strictly Alex has asked which current Premier League player do you most think resembles your playing style? Oh that's a very good question. Are you going to start that one? I'll give you time to think so I'm going to go with, this is not me being boastful although it sounds like it, I'm going to say Harland purely because of his... That's you! Hey man! What are you laughing at? How have you let him get away with that Alan? You're more like his fucking dad Alfie! I think it's the hairstyle mainly that does it. No but in terms of he's like a bigger faster better version of me. So I'll come bring it back a little bit there because whenever I watch football I generally watch it from a striker's perspective and in terms of the movement and when I watch games I always look at where the striker's going to go and I always think get in there and every time I do it with Harland he does exactly what I think in terms of creating that space for himself and so there you go so whether it's boastful or not boastful that will leave you to decide but Alan? Yeah I was going to say him as well Gary! Good man! You've saved me out, you've saved my shame! I would fancy my chances to get 50 goals this season that man's at it. Me too, me too. What about you Micah? Obviously Zabaleta maybe? We can't mention Zabaleta on this podcast or I'm walking! I'm only joking we love Zabaleta. It's too difficult to pick someone really. Maybe a lesser level of Rhys James where I could play centre half, free at the back and he can play right back. So I'd go Rhys James. That's a good shout. We've got one from Lum Fox asking which is the strangest pre-match routine you've witnessed or heard about? What was your pre-match routine Alan? I didn't have one. Certainly in the dressing room I've seen people put left sock on before right sock, not putting the top on until they're out in the tunnel. I thought that was all, I don't know if it works for you then fine. Left sock first or right sock first Micah? Left sock first always. If I put my right on it didn't feel right. And one time I put the... Surely socks just feel like socks? No it didn't! It's sort of... I think I've got OCD as well. I'm quite like, this annoy me this paper, get it right Gary. I'm sorry, it's just a question. Is that not neat enough for you? Oh there we go. It's perfect. If I, yeah, it had to be left foot and a captain's armband. I couldn't wear it on my right arm, it always had to be left side. I have to say I was terrible. Terribly superstitious. Which was weird because I don't believe in any of that nonsense. But I was ridiculous. Oh you did it? I did lots of different things right. Like what? So I'd pretty much get ready in the same order in every game. I'd drive to the game in a certain way and if I scored I'd continue on that route until I didn't score and then I'd take a little detour to change my luck. In the pre... This is embarrassing. In the pre-match build up I would never ever shoot at goal. I don't want to waste one if it went in. So I remember once I kicked a ball to someone and they missed it and it started rolling towards the goal and I ran back and cleared it off the line in the warm up. If I scored in the first half I wouldn't change my shirt at half time. If I didn't score I would change my shirt. If I was in a bad patch where I'd perhaps gone three games without a goal I would get my hair cut. So if you saw me with long hair like Harland you'd know I'd been in a rich vein of form. And then towards the latter stages of my career I actually worked out that being superstitious was unlucky. Oh really? That was a joke. I don't remember how to play football. I don't remember to play football. Honestly it was really... I think all it was though is really is get yourself in a good frame of mind so you're confident. Even if you're having a negative run things are not going well. If you can do something you go well actually I'm going to be fine now. It's complete Codswell up I know. But what if he was bald like Alan and he was going through a bad patch? If I was bald with these ears... God I'd look ridiculous. With what? With these ears I've got... Oh he's going on the... With what? Yeah alright. Sorry. So anyway right next question. This is from Pete Strong Poet. Have you seen Dear England at the National and what does Gary think of his on stage portrayal? That's the theatre, the National. Did you know that Mike? I was confused. Dear England. Yeah it's a play by James Graham which I have been to see. It's terrific actually. It's very enjoyable. It talks about the Southgate era and how he's changed things. And if you remember he did the letter to the public didn't he? Dear England and that's kind of where it comes from. So it takes you from the fact when there was no confidence in the England team and nobody liked them and then it takes you through the tournaments and until that thing that the footballers are popular again. And there's some brilliant performances on the stage in that particular one. Asking me what I think of... I'm actually almost like the narrator in it. It's not actually me, it's the actor playing me. And he's actually... Is he good? He's got me quite good. He's really good actually. And then I met him afterwards and I was with my friend and my friend said to him, was it a bit weird doing it with Gary in the audience? And he went, honestly mate, I said I was so nervous. He said I was uptight to get it right. So I recommend it if you get the chance. I think it's moving from the national into the West End. So you've got big lugs as well has he? Well I think he probably put false ones on and a wig. He had a wig, a great wig, a silver wig. So yeah, recommended if you get the chance to see that. Right. So Walton is asking, what is the favourite shirt swap that you've made? Did you used to do that? Oh, good question. It wasn't a big one. I've got a few. Del Piero. He's very good. Yeah, I've got Del Piero's, yeah. Shirt swap. Thierry Henry. Carlos. Thierry Henry. Thierry Henry, my hero. What more do you want than that? That's not bad. You? I didn't do much. I mean I swapped them but without really knowing what they did. I think the interesting one was Ruggeri who was one of the central defenders for Argentina in the 1986 Hand of God game. And I swapped shirts with him. And it's in my mind because during the World Cup in Qatar, because they quite like me in Argentina because I'm so pro Maradona and so pro Messi. And I was wondering before we were going to film one of the games, like quarterfinal or something, I think Argentina were playing and we were doing the game. And I walked past and somebody shouted from this stage where they were filming. It was outside the ground, but they were doing some pre-match warm up. And this guy's going Gary, Gary. I'm looking up and I'm going, I know that face. I know that face. And he says, come up, sir. I went, okay. I thought, that's Ruggeri. I played it. I'm the Argentinian. I played with all those years ago. And he came up and he went, hi, hi, how are you? And then I realized we were actually on air live in Argentina. I had no idea. We were doing it in Spanish. And he started to tell me, he says, you know, we changed shirts after the game. He said, yeah. He said, I was the only player in that game that was with the Argentinian side that was really disappointed. He said, because our manager, he said before the game, we've got to stop Linneca scoring in Ruggeri. If you do it, I'm going to give you 50 pounds, dollars, whatever it was. And he's, and obviously I scored towards the end, even though we lost. So he said, and so it's quite, so that's why I remembered that, that shirt exchange. It's a nice story. Nice story. Nice story. There's never ever going to be a better shirt swap than Steve Hodge and Maradona. That is very, very true. In fact, which enraged some of the dressing room at the time. They're going, why are you doing with this shirt? You just cheated us out of the game and all this people having a real pop at oddgy, but he got the last laugh. Last laugh. Just a bit. And on that note, we'll have a break. NFL Sunday ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan. Even if you live far away, like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday ticket, your out of market team is never more than a short distance away. Specifically the distance from YouTube remote control. NFL Sunday ticket now on YouTube and YouTube TV. Go to youtube.com slash pre-sale to get $50 off. Terms and embargoes apply. Offer ends 919. No refund. Subscription auto renews. Welcome back to the rest is football question time with me, Gary Lineker, Alan Shearer and Micah Richards. And I've got one here from JPTL. What was the worst digging out you got from a fellow player and what was the reason context? Did you ever get everyone have a pop at you on the pitch? One of your teammates I think he's talking about. On the pitch or in, did they say on the pitch? On off it, anywhere. It doesn't matter. Ooh, that's something. I love these questions. Keep them coming. I'm making you think. I've had loads from teammates where I probably should have passed to them and I didn't shot instead. Yeah. Did you? Anyone in particular? I think most of my, most of my partners upfront would have had that, would have had that criticism. You shot from everywhere, didn't you? I did try and shoot a lot. Yeah. Yeah. And there was only one where, so I was playing last game. Mancini had been sacked at that time and Brian Kidd was the manager. He was playing at home against Norwich. I think it was. I was playing at centre-off in this game and Sammy Nasri came towards a ball, but I didn't play him. I picked someone else and he kept throwing his hands up, you know, like disrespectfully. And I was like, what are you doing? So there's a, there's actually image of me and him walking, like Norwich attacking down one side and I'm walking towards Nasri and we just go in like head to head in the middle of the pitch while the game's going on. But apart from that, that's the only. That's pretty good. Yeah. That was, that was pretty good. I would try to try and get anything happen. No, just, just as, as it was getting really close, we stopped and he thought, I'm not sure I want big Meeks. See what I mean? I'm not sure I want big Meeks, but he's like one of my best mates, but it was just that split moment where I didn't pass to him. He got frustrated. I used to have fallouts with Gazza all the time because he, I mean, he was brilliant and I love Gazza to bits and it always will. But sometimes as a striker, he was frustrating because he'd beat three men and then he'd, you know, the only time he'd ever give you the ball really was if you had no choice, but to give him straight back, which was, which was a sign of how good he was in many ways. But perhaps the most amusing one was that we played at main road. Yeah. That's, that's Manchester City's all ground. I don't know whether you know that Micah. And we were playing a game there for Spurs and I used to, part of my pre-match routine is another, another bizarre, it wasn't, this was not a superstition. This was cause I was always a bit stiff in the legs and stuff. I used to have a little hot bath, like just for two minutes, hot water, stretch my hamstrings, get out, get ready, go out, warm up, come back. So obviously at some grounds they had little small baths and some of them they had in those days with big, those big communion ones, which you'd all gain after the game, which strikes me as bizarre really. But anyway, so on those, on the grounds that had big baths, I used to, the first thing I did when I got to a ground was look to see what the bath situation was. So at main road, it was a big one. So I've, I've put it on hot water and filled it up, get in, stand there, did it in the big ones. You just stand there, did a few stretches, thighs, hamstrings, calves and all that. Are you Bollaco at this time or you got your slips on? Are you naked? I'm Bollaco. I've never heard that phrase, but I think you mean Bollock naked. I'm not going to go in there in my shorts. I'm going to get soggy. So anyway, so anyway, so I stretched for two minutes and Gaza walks into the, to the, and he goes, Hey, you're always doing that. It's like, I'm not going to try and do a Geordiacs. Oh, don't worry. Um, well, or maybe I will. And he says, you always do that. Why, you know, why'd you do it? I said, well, I'm always a bit stiff and I just a quick stretch and it just makes me feel better before I warm up. He went, I might try it. I went, yeah, do it. I said, just, you know, a couple of minutes, quick stretch Bosch out. You get, so I get out. He jumps in. I go out, get my kit on, go out onto the pitch. I do 15, 20 minutes of a warmup, came back in, put my shin pads on. Last thing I always do is have a pee before you play. So I go back into the bathroom and I look in and Gaza is still in the bath. He's been in there for 20 minutes. He's got the water up to his neck like this and it's boiling up and his face looked like a strawberry. I'm going, I went off a fuck's sake. Don't tell me you've been in there since I left. He went, why, I it's great. So I went off for Christ's sake. So we go out, we go out onto the pitch, right? So we plan the first half. We're all over the shop and he is having, he's having one and he's going, oh, links, links, what have you done? What have you done to me? I'm all giddy like. I'm all giddy. Honestly, this is true. So we get in at half time. I think we're two down or something. We sit down in the dressing room and Terry Venner was just gone, Gaza, what's the matter? He went, it's Leningr's fault. He told me to have a bath and I'm all dizzy and I can't. Absolute shambles. That was brilliant. It really was. Yeah. Absolutely brilliant. He was a one off that boy. I'm sure we'll have many Gaza stories from all over the world. Certainly Alan and myself over the forthcoming episodes. We've got a question from Lee Connor. Which players have you played with? Which on the very first day of training, you knew they were a different class. Easy. David Silva, he was next level in training. He just had the way he handled the ball, the way he laid it off. And we know technically he was going to be very good because we knew Silva before, but he was just the one player was like, I couldn't believe we got him. He was next level. And you've told us before on the match of the top 10 podcasts, which we also do together on BBC sounds, that he likes a beer or two. He loves a beer. That's not the fans one I know. He absolutely loves a beer. And there's loads of stories, but you know, there's no rush with it. I'll tell the stories going forward because a lot of people have heard certain bits before, but he's one of the lads. Let's just say, you know, Matt Letizia for me, when we were apprentices together and I went down there and our first training session, I thought, wow, he's just outrageously good. And he didn't care whether it came off or not. He did the same thing again and tried and tried, but technical ability was just unbelievable. What is your I'll go with Gaza again. I mean, it was extraordinarily talented and it would have to be him. I think it's made the biggest impression on me. Last question from Bella. Do any of you have any regrets when it comes to signing for a team or not signing for a team? Well, that's obviously not for me. No, no regrets about Manchester United and all the trophies you might have been able to win. I don't know. Genuinely, genuinely, absolutely. I'm more than happy with my decisions. In fact, if I had the same decision to make, I would do exactly the same thing. I loved my 10 years at Newcastle, despite us not win anything. It was amazing. So I wouldn't change anything. Are you telling the truth there, Alan? Monica, what? You know, like I observe people's body language. And when you was telling that story then, your body language was off. Like it was a hint of I'm not telling the truth here. Stick to being a fucking pundit then and not a body language expert. What about you, Gary? No regrets to where I went, but I was really disappointed with it. In the second season at Barcelona, a really great first season. The second season was started with Terry Venner losing his job after about three or four games. Ridiculously early decision. But Luis Aragonés came in and it was still going well, but halfway through the season, we got contacted or tapped up by Inter, Inter Milan. Right. So and they were a really good team at the time. They got Matthias and Bremer and they were looking for... You only allowed three foreign players in Italian football then, and they were looking for a striker. So I ended up having a sneaky meeting with Trappatoni in Stuttgart, I think it was. We met there, like halfway house sort of thing. And we met and he gave me like the club shirt and badges and all these things and a club tie and all this. I took them all back, but it didn't happen. I think the Barcelona wouldn't accept the fee. They wanted to keep me. So it didn't happen. The reason I was disappointed because what happened then was instead of me, they got Jürgen Klinsmann and bought him the shirt. They had the three Germans. They won two or three Serie A's. They did really well. Super successful side. Scudetto's, I think, is actually the name. So I always thought, oh, I know I always fancied playing in Italian football and Italy. That was a big league back in the day then. I mean, it's still a big league, but it was the place where lots of the superstars went back then. Not that I was one, obviously. I think we're out of time. Thank you so much once again for all your questions. They've certainly made us think and some of them have made us laugh as well. Micah, Alan, thank you very much. We'll speak soon, no doubt. Goodbye."}, "podcast_summary": "The podcast episode features former football players Gary Lineker, Alan Shearer, and Micah Richards answering fan questions. The questions range from who they would prefer to play against during their prime to their favorite tournament experiences. They also discuss superstitions and memorable moments with fellow players. Both Alan and Micah recall players they were impressed with during training, while Gary mentions a missed opportunity to sign with Inter Milan. Overall, they express satisfaction with their career decisions and fond memories of their time playing football.", "podcast_guest": "Micah Richards", "podcast_highlights": "Summary: In this podcast transcript, Gary Lineker, Alan Shearer, and Micah Richards answer various questions from listeners, ranging from their preferences in playing against each other to their favorite shirt swaps and pre-match routines. They also discuss players they came across in training who showed exceptional skills and reflect on regretful decisions in their careers.\n\nKey insights: \n- Micah Richards would have preferred to play against Shearer due to his physicality, while Alan Shearer believes he would have enjoyed playing against Richards.\n- Alan Shearer's favorite backup song for karaoke is \"Sex on Fire\" by Kings of Leon.\n- They discuss their favorite tournaments for broadcasting, with Moscow and Qatar being mentioned.\n- The players they admired for their playing style include David Silva, Steve Hodge, and Matt Letitia.\n- Alan Shearer highlights his regretless decision to stick with Newcastle for 10 years despite not winning any trophies, while Gary Lineker expresses some disappointment in not being able to sign with Inter Milan.\n\nCritical questions:\n- What impact did David Silva's exceptional skills have on Micah Richards' experience in training?\n- How did Steve Hodge feel after swapping shirts with Maradona in the Hand of God game?\n- How did Gazza react to Gary Lineker's pre-match routine of taking a quick bath before warm-up?"}